/* eslint-disable */
module.exports = [
   {
      "name":"Балашов Геннадій Вікторович",
      "age":58,
      "description":"Член політичної партії «5.10». Політична партія «5.10». Партійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/41/4197-Balashov-Gennadij-Viktorovich_origin.png"
   },
   {
      "name":"Безсмертний Роман Петрович",
      "age":53,
      "description":"Без посади. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Be/Bezsmertnyj-Roman-Petrovich_origin.png"
   },
   {
      "name":"Богомолець Ольга Вадимівна",
      "age":53,
      "description":"Народний депутат України. Cамовисування. Безпартійна",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/47/4750-bogomolec-olga-vadimivna_origin.png"
   },
   {
      "name":"Богословська Інна Германівна",
      "age":59,
      "description":"Директор, Всеукраїнська громадська організація \"Віче України\". Cамовисування. Безпартійна",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Bo/Bogoslovskaya-Inna-Germanovna_origin.png",
      opinions: [
        {
          overallText: 'Політична повія. Як би при владі були комуністи, то вчила б,як і її батько на партзібраннях, любити КПРС.',
        }
      ]
   },
   {
      "name":"Бойко Юрій Анатолійович",
      "age":60,
      "description":"Народний депутат України. Cамовисування. Член Політичної Партії \"Опозиційний блок\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Bo/Bojko-Yurij-Anatolievich_origin.png",
      opinions: [
        {
          overallText: 'Бойко 100% в разі перемоги буде повзти на колінах до Путіна і ще й вибачиться перед ним! Не потрібні Україні такі як Бойко лідери!',
        },
        {
          overallText: 'Всі ці "Бойки" за часів Кучми та Януковича привели "руській мир " до Криму та на Донбасс ! Нічого не робили , щоб згорнути ці "сепарскі гуртки", а тільки підтримували їх грошима ! А тепер ця "Вишка- Бойко" щось базікає ---геть з нашої України-- кремлівський запроданець !!!',
        },
        {
          overallText: 'Бойко загнав людей сходу в жопу - пропагуючи срусскій мір! буде базарить все, що можна, щоб отримати голоси і повернутися до корита для казкового збагачення за рахунок обдурених пенсіонерів, які отримають дулю з маком, якщо вони підтримають його! Бойко такий же, як Порошенко бо вони з однієї банди Партії регіонів, яку Порошенко створив, а Бойко на провідних ролях там був! Їм місце в тюрмі всім! Злодії і маніпулятори на довіру!',
        }
      ]
   },
   {
      "name":"Бондар Віктор Васильович",
      "age":43,
      "description":"Народний депутат України. Партія \"Відродження\". Член Партії \"Відродження\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Bo/Bondar-Viktor-Vasilievich_origin.png"
   },
   {
      "name":"Ващенко Олександр Михайлович",
      "age":57,
      "description":"Голова Правління, Громадська організація \"Влада народу\". Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6103-vacshenko-oleksandr-mihajlovich_origin.png"
   },
   {
      "name":"Вілкул Олександр Юрійович",
      "age":45,
      "description":"Народний депутат України. Політична партія \"ОПОЗИЦІЙНИЙ БЛОК – ПАРТІЯ МИРУ ТА РОЗВИТКУ\". Член політичної партії \"ОПОЗИЦІЙНИЙ БЛОК – ПАРТІЯ МИРУ ТА РОЗВИТКУ\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Vi/Vilkul-Aleksandr-Yurievich_origin.png"
   },
   {
      "name":"Габер Микола Олександрович",
      "age":58,
      "description":"Помічник-консультант народного депутата України. Самовисуванець. Член Патріотичної партії України",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/60/6098-gaber-mikola-oleksandrovich_origin.png"
   },
   {
      "name":"Гнап Дмитро Володимирович",
      "age":41,
      "description":"Фізична особа - підприємець Гнап Дмитро Володимирович. Член Політичної партії \"Сила людей\". Політична партія \"Сила людей\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/60/6091-gnap-dmitro-volodimirovich_origin.png"
   },
   {
      "name":"Гриценко Анатолій Степанович",
      "age":61,
      "description":"Доцент кафедри політології. Політична партія \"Громадянська позиція\". Член політичної партії \"Громадянська позиція\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Gr/Gricenko-Anatolij-Stepanovich_origin.png",
      opinions: [
        {
          overallText: 'Шкода не обрали Гриценко в 2014. Точно не випустили б Гиркин зі Слов\'янська і Іловайського котла. Могли б зберегти масу бійців. Кадрова політика була б іншою. Гонтаревої і духу б не було в банківській сфері.',
        },
        {
          overallText: 'Давно слідкую за ним.. також голосував за нього, набрав він якщо я не помиляюсь 2 відсотки. Проблема в тому, що наші люди не хочуть відчути як це жити "по-людскі", в цивілізованій країні.замість того, щоб вибирати толкових ПРОФЕСІЙНИХ людей, ми вибираєм популістів, типу ляшко( 8 відсотків) чмо яке так нічого і не зробило крім того що їсть землю в раді,  навіть за якогось дибіла в масці дарк вейдера проголосувало 40 000 людей..люди це НОНСЕНС.і сама головна проблема, ми не робимо висновків і все швидко забуваємо',
        },
        {
          overallText: 'Весь інтернет і ФБ забитий критикою Гриценко. Знаючи повадки української політики, він стоїть людина, яку панічно боїться чинна влада. Палаців і офшорів у нього немає. Якби на нього був реальний компромат, то на ньому вже були купа кримінальних справ.',
        },
        {
          overallText: 'Я зсередини знаю, що робив і говорив Гриценко в 2005 році, будучи Міністром оборони. Кожен день спілкувався з його близьким оточенням. Він реально порядний Мужик. Знаю, як він приймав рішення по-совісті навіть на шкоду собі. Хоча лізли тоді «данайці» з усіх боків без мила в ...',
        },
        {
          overallText: 'Порядна людина. Виховав гідного сина. Дружина - гідна жінка, один з кращих журналістів України. Чи не зажрались, що не обікрали, що не продався, як основний політикум. Чи не оскотінілся, як наша шоколадна влада.',
        },
        {
          overallText: 'Анатолій Гриценко дуже навіть цікавий чоловік. Чітко формулює свої думки і досить дохідливо для населення. Я давно на пострадянському просторі не спостерігав такого політичного діяча. За міністра оборони Гриценка в ЗСУ зупинилась деградація та розкрадання армії. Суттєво поліпшилась ситуація з житлом для офіцерів. Це був кращий міністр оборони ЗСУ.',
        },
        {
          overallText: 'Гриценко зруйнував і продав армію! Що заважає йому проявити себе і тепер!??? Що буде з Україною? Українці д у м а й т е!',
        },
        {
          overallText: 'Хочеться вірити, що людина дійсно чесна й виконуватиме свої обіцянки, на відміну від теперішнього гаранта.﻿  Якщо його не оберуть на виборах 2019 року президентом, можна відразу складати чемодани, бо в цій країні не має що робити потім буде.',
        }
      ]
   },
   {
      "name":"Данилюк Олександр Володимирович",
      "age":37,
      "description":"Керівник. Самовисуванець. Член Політичної партії \"Громадянський рух \"Спільна Справа\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/60/6096-danilyuk-oleksandr-volodimirovich_origin.png"
   },
   {
      "name":"Дерев'янко Юрій Богданович",
      "age":46,
      "description":"Народний депутат України. Політична партія \"Воля\". Член політичної партії \"Воля\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/32/3266-Derevyanko-Yurij-Bogdanovich_origin.png"
   },
   {
      "name":"Добродомов Дмитро Євгенович",
      "age":42,
      "description":"Народний депутат України. Політична партія \"ГРОМАДСЬКИЙ РУХ \"НАРОДНИЙ КОНТРОЛЬ\". Член ПОЛІТИЧНОЇ ПАРТІЇ \"ГРОМАДСЬКИЙ РУХ \"НАРОДНИЙ КОНТРОЛЬ\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/27/2723-Dobrodomov-Dmitrij-Evgenevich_origin.png"
   },
   {
      "name":"Журавльов Василь Миколайович",
      "age":49,
      "description":"Голова громадської організації \"Федерація футболу м. Маріуполя\". Політична партія \"СТАБІЛЬНІСТЬ\". Член Політичної партії \"СТАБІЛЬНІСТЬ\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6104-zhuravlov-vasil-mikolajovich_origin.png"
   },
   {
      "name":"Зеленський Володимир Олександрович",
      "age":41,
      "description":"Художній керівник. Політична партія «Слуга народу». Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/60/6095-zelenskij-volodimir-oleksandrovich_origin.png",
      opinions: [
        {
          overallText: 'Краще у владі хороший артист, ніж хороший лицемір і відмінний злодій.',
        },
        {
          overallText: 'ЗЕ, а скільки тобі платять за погано зіграну роль кандидата в ПРЕ? Адже актор же крутий - чия задумка так поприкалуватись? Одне радує, канали Медведчука підключилися, а у нього все ж фіг що виходить в Україні.',
        },
        {
          overallText: 'Проти В.Зеленського розгорнулася активна чорна піар-компанія, бо лякає його підтримка виборцями. Засвойте порохоботи, чим більше будете виливати бруд на нього, тим більша популярність буде у Зеленського. Бо набридли цинізм, демагогія, лицемірство, тотальна корупція і свавілля можновладців, відверте знущання з народу.',
        },
        {
          overallText: 'Рейтинг Зеленського тільки зростає, бо все це *** яке полилося на нього, лише підкреслює той факт, що його побоюється поточний гадючник. Проблема всіх інших кандидатів в тому, що вони прагнуть немає країну підняти, а свою дупу прилаштувати, якби метою кожного було добробут країни, то хто був би при владі не мало особливого значення.',
        },
        {
          overallText: 'Якщо до тебе ще не дійшло , що являє собою твій кумир , то знайди в інтернеті будь який його концерт в мошковії і уважно послухай , що воно там меле . Заради росіянських грошей цей єврей назвав себе хохлом і ладен зади кацапам повилизувати не віртуально , а в натурі . І ви , зеботи , хочете оцій нікчемі вручити нашу країну , щоб воно продало її путлеру ? Ви хочете оцього єврейського "Остапа Бендера" посадити нам на шию , як у свій час посадили Яника ? Вам мало було зека , то ще захотілося клоуна Коломойського - найбільшого крутія і махінатора-олігарха України ? Ві з глузду з\'їхали !',
        },
        {
          overallText: 'Ти переживай за свою рашу,бо у вас вічна гнилота,яку не розрушить ніяка сила. А Зеленському захотілось обісратись по самі вуха, -то його пхають в політику Коломойський і банда, і будуть смикати за вірьовочки.як клоуна, -туди не лізь,і це не можна. А наші люди не хочуть думати,що ніякий президент сам один не може так скоро все змінити,бо дуже багато ще є ворогів в Україні таких як - Медведчук,Бойко, і багато інших,які сидять на двох кріслах одночасно і роблять все не на користь Україні і українському народу. З усіх 44 - один Порошенко за Україну , немає і не було достойнішого президента за Порошенко.',
        },
        {
          overallText: 'Чи стане Зеленський президентом? Ледве чи... Але погубить свою артистичну кар\'єру - то вже напевно!',
        },
        {
          overallText: 'У нього відмінна програма! Юлю на культурку, нехай народ байками розважає. Ляшко в цирк - корів цілувати, Мосійчук підкочувати буде. Баню, ясна річ, в приклади. У прокурори.. в прокурори.. один тільки порядним чоловіком - боксер, та й той якщо сказати правду, свиня. Шахрай на шахраї сидить і шахраєм проганяє.',
        },
        {
          overallText: 'Ну тут Зеленський звичайно молодець. Правильний шлях вибрав. Оскільки "президент" він без політичного досвіду. Ідеально зібрати команду міністрів професіоналів з високим рейтингом довіри громадськості. Це і рейтинг йому підніме і частину відповідальності зніме і перекладе її на Уряд професіоналів і населення (яке, як би само вибрало того чи іншого міністра). Крім того, це досить сильно нівелює ареол Коломойського. Коломойський скаже признач того, а Зеленський відповість, не можу його народ вибирає. Коломойський скаже накажи того, а Зеленський скаже не можу його народ вибрав і він нас з тобою (Зеленського і Коломойського) зіллє, тому що ні чим нам не зобов\'язаний.',
        },
        {
          overallText: 'Україна завжди хотіла бути позитивним прикладом для Росії, виберете Зеленського з\'явиться шанс бути зразком (я не кажу що це 100% варіант, навіть навпаки від сили 5-10%), але це шанс, якщо вже Ви на майдани регулярно наважуєтеся, чого вам варто ще раз із Зеленським ризикнути. А раптом вийде, і тоді можливо ми з вас приклад будемо брати.'
        }
      ]
   },
   {
      "name":"Каплін Сергій Миколайович",
      "age":39,
      "description":"Народний депутат України. Політична партія \"СОЦІАЛ-ДЕМОКРАТИЧНА ПАРТІЯ\". Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/36/3620-Kaplin-Sergej-Nikolaevich_origin.png"
   },
   {
      "name":"Кармазін Юрій Анатолійович",
      "age":61,
      "description":"Президент, Громадська організація \"ІНСТИТУТ ПРАВА І СУСПІЛЬСТВА\". Cамовисування. Член Партії захисників Вітчизни",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Ka/Karmazin-Yurij-Anatolievich_origin.png"
   },
   {
      "name":"Кива Ілля Володимирович",
      "age":40,
      "description":"Голова Всеукраїнської професійної спілки МВС, член Соціалістичної партії України. Соціалістична партія України. Партійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/59/5938-kiva-illya-volodimirovich_origin.png"
   },
   {
      "name":"Корнацький Аркадій Олексійович",
      "age":66,
      "description":"Народний депутат України. Cамовисування. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/39/3985-Kornackij-Arkadij-Alekseevich_origin.png"
   },
   {
      "name":"Кошулинський Руслан Володимирович",
      "age":49,
      "description":"Голова Секретаріату, політична партія Всеукраїнське об’єднання \"Свобода\". Політична партія Всеукраїнське об’єднання \"Свобода\". Член політичної партії Всеукраїнське об’єднання \"Свобода\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/14/1476-Koshulinskij-Ruslan-Vladimirovich_origin.png"
   },
   {
      "name":"Кривенко Віктор Миколайович",
      "age":37,
      "description":"Народний депутат України. Політична партія \"Народний Рух України\". Член Політичної партії \"Народний Рух України\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/49/4947-krivenko-viktor-mikolajovich_origin.png"
   },
   {
      "name":"Кривонос Сергій Григорович",
      "age":49,
      "description":"Перший заступник командувача. Політична партія \"Воїни АТО\". Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6101-krivonos-sergij-grigorovich_origin.png"
   },
   {
      "name":"Купрій Віталій Миколайович",
      "age":46,
      "description":"Народний депутат України. Cамовисування. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/21/2154-Kuprij-Vitalij-Nikolaevich_origin.png"
   },
   {
      "name":"Литвиненко Юлія Леонідівна",
      "age":42,
      "description":"Без посади. Самовисуванка. Безпартійна",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6105-litvinenko-yuliya-leonidovna_origin.png"
   },
   {
      "name":"Ляшко Олег Валерійович",
      "age":46,
      "description":"Народний депутат України. Політична партія \"Радикальна партія Олега Ляшка\". Член Політичної партії \"Радикальна партія Олега Ляшка\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Ly/Lyashko-Oleg-Valerievich_origin.png",
      opinions: [
        {
          overallText: 'Коли слухаєш виступ вихованця дитбудинку, стає прикро за велику країну Україну. Прикро за тих українців, які віддають свої голоси за таких піарників, фейковиХ "Правдорубів", які крім особистого збагачення за всі роки ніякої користі не принесли суспільству. І по сьогодні наступають на граблі. Невже можна уявити Ляшко президентом України, соромно не буде?',
        }
      ]
   },
   {
      "name":"Мороз Олександр Олександрович",
      "age":75,
      "description":"Член політичної партії «Соціалістична партія Олександра Мороза». Політична партія «Соціалістична партія Олександра Мороза». Партійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Mo/Moroz-Aleksandr-Aleksandrovich_origin.png"
   },
   {
      "name":"Мураєв Євгеній Володимирович",
      "age":42,
      "description":"Народний депутат України. Політична партія \"НАШІ\". Член політичної партії \"НАШІ\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/41/4180-Muraev-Evgenij-Vladimirovich_origin.png"
   },
   {
      "name":"Наливайченко Валентин Олександрович",
      "age":53,
      "description":"Голова політичної партії «Громадсько-політичний рух Валентина Наливайченка «Справедливість». Політична партія «Громадсько-політичний рух Валентина Наливайченка «Справедливість». Партійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Na/Nalivajchenko-Valentin-Aleksandrovich_origin.png"
   },
   {
      "name":"Насіров Роман Михайлович",
      "age":40,
      "description":"Без посади. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/50/5063-nasirov-roman-mihajlovich_origin.png"
   },
   {
      "name":"Новак Андрій Яремович",
      "age":46,
      "description":"Тимчасово не працює. Політична партія \"ПАТРІОТ\". Член Політичної партії \"ПАТРІОТ\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6102-novak-andrij-yaremovich_origin.png"
   },
   {
      "name":"Носенко Сергій Михайлович",
      "age":49,
      "description":"Старший керуючий директор. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6100-nosenko-sergij-mihajlovich_origin.png"
   },
   {
      "name":"Петров Володимир Володимирович",
      "age":41,
      "description":"Без посади. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6107-petrov-volodimir-volodimirovich_origin.png"
   },
   {
      "name":"Порошенко Петро Олексійович",
      "age":53,
      "description":"Президент України. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Po/Poroshenko-Petr-Alekseevich_origin.png",
      opinions: [
        {
          overallText: 'Виконайте свої обіцянки, які ви давали, стоячи на майдані! На вас люди надіються, за 2 роки вашого керівництва люди стали жити не краще, а гірше набагато ніж до вашого президентства. Зробіть висновки і надайте відповідь в інтернет-мережі. Чого ви добились своїм керівництвом і до чого ми дійшли. Війна на Донбасі - це не є пріоритет, а біда, якою накрило всю нашу країну і весь наш народ. Не треба на цьому заробляти кошти, де ваша обіцянка продати бізнес "Рошен". До тих   пір, поки ви не зробите перший крок до налагодження проблем в бізнесі простих громадян, це означає, що ви ніколи не продасте свій бізнес. P.S. Вважаю, що війна на Донбасі - це є пряме відмивання коштів в кишені олігархів і правлячих структур нашої країни. До тих пір, поки буде таке керівництво при владі, не буде ні демократії, ні злагодженості і ніякий Євросоюз з голими задами нас не прийме, як би ви не старались. Щоб зад не світився, треба чимось його прикрити.',
          pros: [
            'Ніколи від нього не б в захваты, але, поки за нього не соромно. Особливо після Яника. Та й не позаздриш йому- т аке дісталося! Сподіваюся, що хитрість і розважливість його будуть на користь і країні. Альтернативи адже все одно поки не видно.',
          ],
          cons: [
            'Будує бізнес Липецької фабриці.',
            'Коррупція й надалі процвітає, особливо в медицині.',
          ],
        },
        {
          overallText: 'Петро Олексійович - самий чесний та порядний президент, за усю історію України та й мабудь усього світу взагалі....У нього дуже добра команда.....Усі чесні та талановиті. Немає уряду кращого за наший -Український...Немає корупції, усе прозоро і порядно...Жити стало краще, люди дуже щасливі...Я пишаюся нашим Президентом... А тому, хто пише хибні відгуки, той просто заздрить нашому прекрасному життю в нашій Україні. Слава Україні!!!',
          pros: [
            'На даному етапі - кращий президент, який був у цій країні. Не можна сказати, що він хоча б хороший, але до нього були набагато більш бездарні персони. Все-таки, успішне ведення бізнесу накладає відбиток на мисленні.',
          ],
          cons: [
            'СМІ як і раніше брешуть. Пару днів тому у Львові було страйк проти нинішньої влади на Україні, якщо ще можна так її називати. Але українські ЗМІ цього не показували, бо ці канали залежать від цих політиків. Чому був страйк проти нинішньої влади від правого сектора?',
            'Пенсії урізати, соціалку не платите, ціни на все ростуть...... Ті, хто злив Донбас і винен у війні (тому що дав Педераціі можливість увійти) такі як Турчинов і Тімошенніца сидять при владі..... Повірте ви народ штовхаєте в крайність і судячи з останньої тенденції - вибух країни зсередини вже близький як ніколи!!! Ваше завдання напевно розвалити країну - добре це виходить як бачу, так якщо ви вирішили розвалити її і здати Педераціі - навіщо люди тоді гинуть ??? За чим в РНБО сидять зрадника як і в Генштабі? чому на Азарова до сих пір нічого не порушено і Інтерпол через це не може оголосити його в розшук????',
            'Повільно, дуже повільно, але йдуть реформи. Вже за одне це я буду підтримувати нашого президента. Після Кравчука, Кучми і Ющенка - Порошенко рулить. З Януковичем навіть порівнювати непристойно. У порівнянні з ним Порошенко вище всяких похвал.',
            'Якщо ні з ким не порівнювати, то реально м\'якуватий, нерішучий, але чесний - за одне це він молодець!',
          ],
        },
        {
          overallText: 'Ви відчуваєте себе своїм класним хлопцем на трибунах Європи, посміхаючись співаючи англійською - прям Майкл Джексон! Не спокушайтеся, готовтесь стояти не перед камерою СНН, а перед просоченими горем Особами Матерів Загиблих Солдат, перед Інвалідами і просто перед народом України який страждає і виснажується через вашої вперто і недалекоглядності. Україна прокинься!',
          cons: [
            'Ви знаєте що мені як Українцю дивлячись на вашу чергову фотографію в встановлених дешевих позах зіткнення пальчиків однієї руки з іншою або інші сценарії стає гидко і починає нудити, а ви ще набираєтесь нахабства і надягаєте військову форму, імітуючи при цьому головнокомандувача, напевно свого часу навіть у армії не будучи. Сором та ганьба перед матерями загиблих солдат, ви бесчестите їх горе своїм нікчемним виглядом! Я не знаю кого ви там бачите, стоячи перед дзеркалом, але для народу України ви ніхто, ніщо і звати вас ніяк, звертаюся до Господа Бога: Улюблений Господь допусти будь ласка подальшого кровопролиття народу, дай цим нікчемним правителям по заслугах!',
          ]
        },
        {
          overallText: 'Шановний Петре Олексійовичу, скажіть будь ласка - КОЛИ Ви наведете порядок в бензинових сфері? Нафта вже впала до 50 доларів за барель марки БРЕНД, а у нас тримаються ціни на бензин на тому рівні коли нафта коштувала 100 і вище доларів за Барель!!! Це явна спекуляція - і збагачення Вашого оточення! Спустіть ціни на БЕНЗИН!!! Народ терпить поки є терпіння - але не ФАКТ, що це триватиме так само довго як при ОВОЧІ!!!',
        },
        {
          overallText: 'У мене відчуття, що 31 березня увечері Порошенко таємно втікатиме через Крим. От лише куди, не знаю. Чи треба буде він там комусь.',
        }
      ],
   },
   {
      "name":"Ригованов Руслан Олександрович",
      "age":45,
      "description":"Виконуючий обов'язки начальника. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/60/6099-rigovanov-ruslan-oleksandrovich_origin.png"
   },
   {
      "name":"Скоцик Віталій Євстафійович",
      "age":47,
      "description":"Професор кафедри конярства та бджільництва. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/60/6094-skocik-vitalij-evstafijovich_origin.png"
   },
   {
      "name":"Смешко Ігор Петрович",
      "age":64,
      "description":"Член політичної партії «Сила і Честь». Самовисуванець. Партійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/47/4784-smeshko-igor-petrovich_origin.png"
   },
   {
      "name":"Соловйов Олександр Миколайович",
      "age":46,
      "description":"Заступник директора, ТОВ \"ЮРИДИЧНА КОМПАНІЯ \"ФЕБ\". Політична партія \"РОЗУМНА СИЛА\". Член Політичної партії \"РОЗУМНА СИЛА\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/61/6106-solovjov-oleksandr-mikolajovich_origin.png"
   },
   {
      "name":"Тарута Сергій Олексійович",
      "age":64,
      "description":"Народний депутат України. Політична партія \"ОСНОВА\". Член політичної партії \"ОСНОВА\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/47/4717-taruta-sergij-oleksijovich_origin.png"
   },
   {
      "name":"Тимошенко Юлія Володимирівна",
      "age":58,
      "description":"Народний депутат України. Політична партія Всеукраїнське об’єднання \"Батьківщина\". Член політичної партії Всеукраїнське об’єднання \"Батьківщина\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/Ti/Timoshenko-Yuliya-Vladimirovna_origin.png",
      opinions: [
        {
          overallText: 'Такі, як вона повинні бути в політиці, але президентом, тим більше в наш час повинен бути чоловік',
          pros: [
            'рішуча, розумна, цілеспрямована',
          ],
          cons: [
            'занадто зациклюється на інтригах',
          ]
        },
        {
          overallText: 'Мені ніколи особливо не подобалася Тимошенко, але остаточно моя думка про неї зіпсувалась коли я побачила її на височенних підборах, як то чи не логічно лежати кілька років з хребетної грижею (говорили навіть, що вона якийсь час не могла вставати), а тут виходить на таких підборах, на яких не кожна молоденька дівчина вистоїть. А це, в черговий раз підтверджує, що не така вже чесна перед нами Юля. З приводу її майбутнього в політиці, то мені здається, що у Юлії Тимошенко воно є, але її позиція не буде настільки ж впливовою як була кілька років тому. Дуже багатьох вона розчарувала',
        },
        {
          overallText: 'Сподіваюся, це лише початок її зовньополітичної діяльності. Тимошенко - об\'ктивно найкращий кандидат у президенти. Після виборів вона зможе себе проявити ще більше. Нарешті побачимо, яким має бути справді гідний український Президент. Скільки б на неї бруду не виливали, особливо зараз, коли дехто дуже хоче залишитись при владі. Все-одно переможе Тимошенко',
          pros: [
            'Поки що не помічав щоб інші політики, на відміну від Тимошенко, так активно їздили на зустріч з іноземними діячами що б заявити про Україну',
            'Мало того, вона ще активно працює, над новою ефективного моделлю розвитку нашої країни, поки інші її тільки закопують',
          ],
          cons: [
            '"Глобальні системні зміни" - це не про Тимошенко). Уже глобально міняли в 2014',
          ]
        },
        {
          overallText: 'Жулька починає сильно істерити, як тільки гляне на останні соцопитування, які не дають їй шансів потрапити у 2-й тур. У хід починають йти говномети юлькоботов і її особиста витончена брехня. Їх би обох в один пансіонат (за власний рахунок) за містом і нехай хоч 10 турів проводять між собою. Гарна пісня була у Pink Floyd ... Take all your overgrown infants away somewhere And build them a home, a little place of their own. ... And they can appear to themselves every day On closed circuit T.V. To make sure they\'re still real. ..',
        }
      ],
   },
   {
      "name":"Тимошенко Юрій Володимирович",
      "age":58,
      "description":"Народний депутат України. Cамовисування. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/52/5266-_origin.png"
   },
   {
      "name":"Шевченко Ігор Анатолійович",
      "age":48,
      "description":"Без посади. Самовисуванець. Безпартійний",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/15/1506-Shevchenko-Miхail-Vasilevich_origin.png"
   },
   {
      "name":"Шевченко Олександр Леонідович",
      "age":48,
      "description":"Народний депутат України. Політична партія \"УКРАЇНСЬКЕ ОБ’ЄДНАННЯ ПАТРІОТІВ – УКРОП\". Член політичної партії \"УКРАЇНСЬКЕ ОБ’ЄДНАННЯ ПАТРІОТІВ – УКРОП\"",
      "photoUrl":"http://media.slovoidilo.ua/media/cache/person_thumb_exx/uploads/persons/origin/31/3147-Shevchenko-Aleksandr-Leonidovich_origin.png"
   }
];
// function diff_years(dt2, dt1) {
//   var diff =(dt2.getTime() - dt1.getTime()) / 1000;
//   diff /= (60 * 60 * 24);
//   return Math.abs(Math.round(diff/365.25));
// }
//
// const links = $('.pol-list__ul_li_prof-lnk').toArray();
//
// const processLink = async (links, prev = []) => {
//   const linkElem = links.splice(0, 1);
//   const item = $(linkElem);
//   const href = item.attr('href');
//   const photoUrl = `http://${$(item.find('.pol-list__ul_li_img')).attr('src').slice(2)}`;
//   var w2 = window.open(href);
//   const obj = await new Promise(resolve => {
//     w2.addEventListener('load', function() {
//       var doc2 = w2.document
//       const obj = {
//         name: $('h2', doc2).text(),
//         age: diff_years(new Date(), new Date($('.title:contains("Дата народження")', doc2).next().text())),
//         citizen: $('.title:contains("Громадянство")', doc2).next().text(),
//         position: $('.title:contains("Посада (зайнята)")', doc2).next().text(),
//         type: $('.title:contains("Партійність")', doc2).next().text(),
//         party: $('.title:contains("Суб\'єкт висування або самовисування")', doc2).next().text(),
//         photoUrl,
//       };
//       w2.close();
//       resolve(obj);
//     }, false);
//   });
//   const newResult = [ ...prev, obj ];
//   if (links.length) {
//     return processLink(links, newResult);
//   } else {
//     return newResult;
//   }
// };
//
// processLink(links).then(res => {
//   const capitalize = (s) => {
//     if (typeof s !== 'string') return ''
//     return s.charAt(0).toUpperCase() + s.slice(1)
//   };
//
//   const newRes = res.map(candidate => ({
//     name: candidate.name,
//     age: candidate.age,
//     description: `${capitalize(candidate.position)}. ${capitalize(candidate.party)}. ${capitalize(candidate.type)}`,
//     photoUrl: candidate.photoUrl,
//   }));
//
//   const json = JSON.stringify(newRes);
//   console.log(json);
// });
